microchip-pic-avr-examples/dpsk3-power-boost-voltage-mode-control/dpsk_boost_vmc.X/sources/common/p33c_pral/p33c_uart.c
/*
 * File:   p33c_uart.c
 * Author: M91406
 *
 * Created on May 29, 2021, 4:23 PM
 */


#include <xc.h> // include processor files - each processor file is guarded.  
#include <stdint.h> // include standard integer data types
#include <stdbool.h> // include standard boolean data types
#include <stddef.h> // include standard definition data types

#include "uart.h"

#if defined (U8MODE)
volatile uint16_t UartDmaTrg_Rx [] = {
    DMATRG_UART1_RX, DMATRG_UART2_RX, DMATRG_UART3_RX, DMATRG_UART4_RX,
    DMATRG_UART5_RX, DMATRG_UART6_RX, DMATRG_UART7_RX, DMATRG_UART8_RX    
};
volatile uint16_t UartDmaTrg_Tx [] = {
    DMATRG_UART1_TX, DMATRG_UART2_TX, DMATRG_UART3_TX, DMATRG_UART4_TX,
    DMATRG_UART5_TX, DMATRG_UART6_TX, DMATRG_UART7_TX, DMATRG_UART8_TX    
};
#elif defined (U7MODE)
volatile uint16_t UartDmaTrg_Rx [] = {
    DMATRG_UART1_RX, DMATRG_UART2_RX, DMATRG_UART3_RX, DMATRG_UART4_RX,
    DMATRG_UART5_RX, DMATRG_UART6_RX, DMATRG_UART7_RX
};
volatile uint16_t UartDmaTrg_Tx [] = {
    DMATRG_UART1_TX, DMATRG_UART2_TX, DMATRG_UART3_TX, DMATRG_UART4_TX,
    DMATRG_UART5_TX, DMATRG_UART6_TX, DMATRG_UART7_TX
};
#elif defined (U6MODE)
volatile uint16_t UartDmaTrg_Rx [] = {
    DMATRG_UART1_RX, DMATRG_UART2_RX, DMATRG_UART3_RX, DMATRG_UART4_RX,
    DMATRG_UART5_RX, DMATRG_UART6_RX
};
volatile uint16_t UartDmaTrg_Tx [] = {
    DMATRG_UART1_TX, DMATRG_UART2_TX, DMATRG_UART3_TX, DMATRG_UART4_TX,
    DMATRG_UART5_TX, DMATRG_UART6_TX
};
#elif defined (U5MODE)
volatile uint16_t UartDmaTrg_Rx [] = {
    DMATRG_UART1_RX, DMATRG_UART2_RX, DMATRG_UART3_RX, DMATRG_UART4_RX,
    DMATRG_UART5_RX 
};
volatile uint16_t UartDmaTrg_Tx [] = {
    DMATRG_UART1_TX, DMATRG_UART2_TX, DMATRG_UART3_TX, DMATRG_UART4_TX,
    DMATRG_UART5_TX
};
#elif defined (U4MODE)
volatile uint16_t UartDmaTrg_Rx [] = {
    DMATRG_UART1_RX, DMATRG_UART2_RX, DMATRG_UART3_RX, DMATRG_UART4_RX
};
volatile uint16_t UartDmaTrg_Tx [] = {
    DMATRG_UART1_TX, DMATRG_UART2_TX, DMATRG_UART3_TX, DMATRG_UART4_TX
};
#elif defined (U3MODE)
volatile uint16_t UartDmaTrg_Rx [] = {
    DMATRG_UART1_RX, DMATRG_UART2_RX, DMATRG_UART3_RX
};
volatile uint16_t UartDmaTrg_Tx [] = {
    DMATRG_UART1_TX, DMATRG_UART2_TX, DMATRG_UART3_TX
};
#elif defined (U2MODE)
volatile uint16_t UartDmaTrg_Rx [] = {
    DMATRG_UART1_RX, DMATRG_UART2_RX
};
volatile uint16_t UartDmaTrg_Tx [] = {
    DMATRG_UART1_TX, DMATRG_UART2_TX
};
#elif defined (U1MODE)
volatile uint16_t UartDmaTrg_Rx [] = {
    DMATRG_UART1_RX
};
volatile uint16_t UartDmaTrg_Tx [] = {
    DMATRG_UART1_TX
};
#endif

#define UartInterfase_GetDmaTriggerRx(x) (volatile uint16_t)UartDmaTrg_Rx[x-1]
#define UartInterfase_GetDmaTriggerTx(x) (volatile uint16_t)UartDmaTrg_Tx[x-1]

#define UART_RXREG_ADDR_OFFSET  (uint16_t)(&U1RXREG - &U1MODE)
#define UART_TXREG_ADDR_OFFSET  (uint16_t)(&U1TXREG - &U1MODE)

/*********************************************************************************
 * @ingroup dev-layer-uart-properties-public
 * @var     rx_buffer
 * @brief   UART receive byte-data buffer
 * @details
 *  UART receive data buffer to which the UART interface is writing to when
 *  new data is received.
 **********************************************************************************/
//volatile uint8_t __attribute__((near)) rx_buffer[UART_RX_BUFFER_SIZE];

/*********************************************************************************
 * @ingroup dev-layer-uart-properties-public
 * @var     rx_buffer_size
 * @brief   UART receive data buffer size
 * @details
 *  Size of the UART receiver data buffer in bytes
 **********************************************************************************/
//volatile uint16_t rx_buffer_size = (sizeof(rx_buffer)/sizeof(rx_buffer[0])); 

/*********************************************************************************
 * @ingroup dev-layer-uart-properties-public
 * @var     tx_buffer
 * @brief   UART transmit byte-data buffer
 * @details
 *  UART transmit data buffer from which the UART interface is reading new 
 *  data to be transmitted
 **********************************************************************************/
//volatile uint8_t __attribute__((near)) tx_buffer[UART_TX_BUFFER_SIZE];

/*********************************************************************************
 * @ingroup dev-layer-uart-properties-public
 * @var     tx_buffer_size
 * @brief   UART transmit data buffer size
 * @details
 *  Size of the UART transmit data buffer in bytes
 **********************************************************************************/
//volatile uint16_t tx_buffer_size = (sizeof(tx_buffer)/sizeof(tx_buffer[0])); 

/*********************************************************************************
 * @ingroup lib-layer-pral-functions-public-uart
 * @fn      uint16_t p33c_UartPort_Initialize(volatile struct UART_INTERFACE_s* port)
 * @brief   Initializes a UART interface with predefined user settings
 * @param   port Pointer to UART interface object of type UART_INTERFACE_s
 * @return 0 = failure, Initializing UART interface was not successful
 * @return 1 = success, Initializing UART interface was successful
 * @details
 *  This function can be used to initialize a UART interface by handing over
 *  a predefined user-UART interface object.  
 *
 **********************************************************************************/

volatile uint16_t p33c_UartPort_Initialize(volatile struct UART_INTERFACE_s* port) {

    volatile uint16_t retval=1;
    volatile struct P33C_GPIO_INSTANCE_s* gpio;
    volatile struct P33C_DMA_MODULE_s* dmac;
    volatile struct P33C_DMA_INSTANCE_s* dma;
    volatile struct P33C_UART_INSTANCE_s* uart;
	
    // Check if object exists
    if (port == NULL)
        return(0);
    
    // Initialize device port pins assigning RX/TX
    p33c_PPS_UnlockIO();
    p33c_PPS_RemapInput(port->RxD.io.rpid, PPSIN_U1RX);
    p33c_PPS_RemapOutput(port->TxD.io.rpid, PPSOUT_U1TX);
    p33c_PPS_LockIO();

    // Set TRIS registers of RX/TX
    gpio = p33c_GpioInstance_GetHandle(port->TxD.io.port);
    if(gpio != NULL) {
        gpio->TRISx.value &= ~(0x0001 << port->TxD.io.pin);
    }
    else { return(0); }

    gpio = p33c_GpioInstance_GetHandle(port->RxD.io.port);
    if(gpio != NULL) {
        gpio->TRISx.value |= (0x0001 << port->RxD.io.pin);
    }
    else { return(0); }

    // Initialize selected UART
    uart = p33c_MpUartPort_GetHandle(port->uart);
    if (uart != NULL)
    {
        retval &= p33c_MpUartPort_ConfigWrite(port->uart, uartConfigClear);

        uart->UxSTA.bits.TXMTIE = true; // Enable TX interrupt
        uart->UxSTA.bits.RXBKIE = true; // Enable RX interrupt
        uart->UxSTAH.bits.UTXISEL = 0;  // Generate trigger when complete buffer is empty
        uart->UxSTAH.bits.URXISEL = 0;  // Generate trigger receive interrupt when there is 1 word or more in the buffer
    }
    
    // Enable DMA support
    if ((port->status.rx_use_dma) || (port->status.tx_use_dma))
    {
        // Check DMA module is used, enable if not
        dmac = p33c_DmaModule_GetHandle();
        if (dmac != NULL) {
            if (!dmac->DmaCon.bits.DMAEN) {
                p33c_DmaModule_ConfigWrite(dmaModuleConfigClear);
            }
            dmac->DmaCon.bits.DMAEN = true; // Enable DMA controller first
        }
        else { return(0); }

        // Initialize RxD DMA channel
        if (port->status.rx_use_dma) {
            
        dma = p33c_DmaInstance_GetHandle(port->RxD.dma);
            
        if (dma != NULL) {
            retval &= p33c_DmaInstance_ConfigWrite(port->RxD.dma, dmaInstanceConfigRxD);
            dma->DMASRCx.value = (uint16_t)&(uart->UxRXREG); // Set fixed source address for Receive channel
            dma->DMAINTx.bits.CHSEL = UartInterfase_GetDmaTriggerRx(port->uart); // DMA Channel Trigger Selection: UARTx Receiver
        }
        else { return(0); }
        }
        else { /* do nothing */ }

        // Initialize TxD DMA channel
        if (port->status.tx_use_dma) {
            
        dma = p33c_DmaInstance_GetHandle(port->TxD.dma);
            
        if (dma != NULL) {
            retval &= p33c_DmaInstance_ConfigWrite(port->TxD.dma, dmaInstanceConfigTxD);
            dma->DMADSTx.value = (uint16_t)&(uart->UxTXREG); // Set fixed destination address for Transmit channel
            dma->DMAINTx.bits.CHSEL = UartInterfase_GetDmaTriggerTx(port->uart); // DMA Channel Trigger Selection: UARTx Transmitter
        }
        else { return(0); }
        }
        else { /* do nothing */ }

