microchip-pic-avr-examples/dpsk3-power-boost-voltage-mode-control/dpsk_boost_vmc.X/sources/common/p33c_pral/p33c_uart.c
    }

    // Set READY bit indicating successful configuration
    port->status.ready = true;
    
	return(retval);

}


/*********************************************************************************
 * @ingroup lib-layer-pral-functions-public-uart
 * @fn      volatile uint16_t p33c_MpUartPort_OpenPort(volatile uint16_t port, volatile enum UART_BAUDRATE_e baud, volatile enum UART_DATA_BITS_e data_bits, volatile enum UART_PARITY_e parity, volatile enum UART_STOP_BITS_e stop_bits, volatile enum UART_FLOWCONRTOL_e flow_control)
 * @brief  Opens the specified UART port with the specified settings in standard RS232 mode
 * @param 0 = port_no      Index of UART instance of type unsigned integer
 * @param 1 = baud         Baud Rate in signal segments per second of type unsigned integer of the UART instance Baud Rate generator
 * @param 2 = data_bits    Data bit length
 * @param 3 = parity       Data parity type
 * @param 4 = stop_bits    Data bit length
 * @param 5 = flow_control Flow control option
 * @return 0 = failure, disabling UART port was not successful
 * @return 1 = success, disabling UART port was successful
 * 
 * @details
 *  This function opens a UART interface port with the respective settings 
 *  specified by in the function parameters. No data send and receive function
 *  will be enabled by default.
 *
 **********************************************************************************/

volatile uint16_t p33c_UartPort_OpenPort(
    volatile uint16_t port_no, volatile enum UART_BAUDRATE_e baud, 
    volatile enum UART_DATA_BITS_e data_bits, volatile enum UART_PARITY_e parity, 
    volatile enum UART_STOP_BITS_e stop_bits, volatile enum UART_FLOWCONRTOL_e flow_control) 
{
    
    volatile uint16_t retval=1;
	volatile struct P33C_UART_INSTANCE_s* uart;
    
    // Check port number specified by user
    if (port_no > P33C_UART_COUNT)
        return(0);

    // Capture UART instance SFR block
    uart = p33c_MpUartPort_GetHandle(port_no);
    
    // Check system oscillator settings
    if (SystemFrequencies.fosc == 0)
        return(0);

    // Selecting the data bits
    switch(data_bits) {
        
        case UART_DATABITS_7:
            uart->UxMODE.bits.MOD = 0b0001; // Enable 7-bit UART mode
            break;
        
        case UART_DATABITS_8:
            
            // Selecting the data parity
            switch(parity) {
                
                case UART_PARITY_NONE:
                    uart->UxMODE.bits.MOD = 0b0000; // Enable 8-bit UART mode, no parity
                    break;
                case UART_PARITY_ODD:
                    uart->UxMODE.bits.MOD = 0b0010; // Enable 8-bit UART mode, odd parity
                    break;
                case UART_PARITY_EVEN:
                    uart->UxMODE.bits.MOD = 0b0011; // Enable 8-bit UART mode, even parity
                    break;
                default:
                    return(0);
            }
            
            break;
            
        default:
            return(0);
    }
    

    // Selecting the data bits
    switch(stop_bits) {
        case UART_STOPBITS_1:
            uart->UxMODEH.bits.STSEL = 0b00;    // 1 Stop bit sent, 1 checked at receive
            break;
        case UART_STOPBITS_15:
            uart->UxMODEH.bits.STSEL = 0b01;    // 1.5 Stop bits sent, 1.5 checked at receive
            break;
        case UART_STOPBITS_2:
            uart->UxMODEH.bits.STSEL = 0b10;    // 2 Stop bits sent, 2 checked at receive
            break;
        default:
            return(0);
    }
    
    // Selecting the data parity
    switch(flow_control) {
        case UART_FLOWCONRTOL_NONE:
            uart->UxMODEH.bits.FLO = 0b00;  // Flow control off
            break;
        case UART_FLOWCONRTOL_HARDWARE:
            uart->UxMODEH.bits.FLO = 0b10;  // RTS-DSR (for TX side)/CTS-DTR (for RX side) hardware flow control
            break;
        case UART_FLOWCONRTOL_XON_XOFF:
            uart->UxMODEH.bits.FLO = 0b01;  // XON/XOFF software flow control
            break;
        default:
            return(0);
    }

    // Set Baud Rate Generator Divider Mode to Fractional Divider
    uart->UxMODEH.bits.BCLKSEL = 0b00; // Baud Clock Source Selection: FOSC/2 (=FP)
    uart->UxMODEH.bits.BCLKMOD = 1; // Use fractional baud rate divider mode (highest resolution)
    
    // Calculate baud rate generator divider
    
    retval &= p33c_UartPort_SetBaudrate (port_no, baud);

    // Clear pending TX error flags
    uart->UxSTA.bits.TXCIF = 0; // Clear Transmit Collision Interrupt Flag bit
    uart->UxSTAH.bits.TXWRE = 0; // Clear TX Write Transmit Error Status bit

    uart->UxSTA.bits.OERR = 0;      // Clear Receive Buffer Overflow Interrupt Flag bit
    uart->UxSTA.bits.RXBKIF = 0;
    
    // Enable RX, TX and UART port instance
    uart->UxSTAH.bits.UTXBE  = 1;    // Reset TX FIFO
    uart->UxSTAH.bits.URXBE  = 1;    // Reset RX FIFO
    uart->UxMODE.bits.UTXEN  = true; // Enable Transmitter
    uart->UxMODE.bits.URXEN  = true; // Enable Receiver
    uart->UxMODE.bits.UARTEN = true; // Enable UART Instance
    
	return(retval);

}

/*********************************************************************************
 * @ingroup lib-layer-pral-functions-public-uart
 * @fn      volatile uint16_t p33c_UartPort_Open(volatile uint16_t port_no)
 * @brief   Opens a previously configured port
 * @param   port_no Index of UART peripheral instance of type unsigned integer
 * @return 0 = failure, Opening UART port was not successful
 * @return 1 = success, Opening UART port was successful
 * 
 * @details
 *  Opens a previously configured UART peripheral instance by enabling the UART 
 *  instance including receive and transmit channels. 
 *  No further settings will be set. When you try to open a port for the first 
 *  time, please use function 'p33c_UartPort_OpenPort(...)' specifying Baud Rate, 
 *  Data Bits, Stop Bits, Parity and Flow Control.
 *
 **********************************************************************************/

volatile uint16_t p33c_UartPort_Open(volatile uint16_t port_no) {

    volatile uint16_t retval=1;
	volatile struct P33C_UART_INSTANCE_s* uart;
    
    // Check port number specified by user
    if (port_no > P33C_UART_COUNT)
        return(0);
    
    // Capture UART instance SFR block
    uart = p33c_MpUartPort_GetHandle(port_no);
    if (uart != NULL) {
    
        // Enable RX, TX and UART instance
        uart->UxMODE.bits.UTXEN = true;
        uart->UxMODE.bits.URXEN = true;
        uart->UxMODE.bits.UARTEN = true;

        // Check if port opened successfully
        retval = (bool) (
                uart->UxMODE.bits.UTXEN &
                uart->UxMODE.bits.URXEN &
                uart->UxMODE.bits.URXEN
            );
    }
    else { retval = 0; } // return error
        
