microchip-pic-avr-examples/dpsk3-power-boost-voltage-mode-control/dpsk_boost_vmc.X/sources/common/p33c_pral/p33c_uart.c
	return(retval);

}

/*********************************************************************************
 * @ingroup lib-layer-pral-functions-public-uart
 * @fn      volatile uint16_t p33c_UartPort_Close(volatile uint16_t port_no)
 * @brief   Closes a previously configured port
 * @param   port_no Index of UART peripheral instance of type unsigned integer
 * @return 0 = failure, Closing UART port was not successful
 * @return 1 = success, Closing UART port was successful
 * 
 * @details
 *  Closes a previously opened UART peripheral instance by disabling the UART 
 *  instance including receive and transmit channels. To reopen a closed port, 
 *  please use function 'p33c_UartPort_Open', if no changes to settings have to 
 *  be made, or function 'p33c_UartPort_OpenPort(...)' specifying Baud Rate, 
 *  Data Bits, Stop Bits, Parity and Flow Control.
 *
 **********************************************************************************/

volatile uint16_t p33c_UartPort_Close(volatile uint16_t port_no) {

    volatile uint16_t retval=1;
	volatile struct P33C_UART_INSTANCE_s* uart;
    
    // Check port number specified by user
    if (port_no > P33C_UART_COUNT)
        return(0);
    
    // Capture UART instance SFR block
    uart = p33c_MpUartPort_GetHandle(port_no);
    if (uart != NULL) {
    
        // Enable RX, TX and UART instance
        uart->UxMODE.bits.UTXEN = false;
        uart->UxMODE.bits.URXEN = false;
        uart->UxMODE.bits.UARTEN = false;

        // Clear status flag bits
        uart->UxSTA.value &= 0x00FF; // Clear interrupt flag bits
        uart->UxSTAH.bits.TXWRE = false; // Clear TX Write Transmit Error Status bit

        // Check if port closed successfully
        retval = (1 - (bool)(
                uart->UxMODE.bits.UTXEN &
                uart->UxMODE.bits.URXEN &
                uart->UxMODE.bits.URXEN
            ));

    }
    else { retval = 0; } // return error
    
	return(retval);

}

/*********************************************************************************
 * @fn uint16_t p33c_UartPort_SetBaudrate(volatile uinat16_t port_no, volatile uint16_t baud)
 * @ingroup lib-layer-pral-functions-public-uart
 * @brief  Sets the Baud Rate of the specified UART instance
 * @param  port_no Index of UART peripheral instance of type unsigned integer
 * @param  baud  Baud Rate in signal segments per second of type unsigned integer of the UART peripheral instance Baud Rate generator
 * @return 0 = failure, setting UART Baud Rate was not successful
 * @return 1 = success, setting UART Baud Rate was successful
 * 
 * @details
 *     This function writes the value specified by 'baud' to the Baud Rate 
 *     register of the specified UART peripheral instance.
 * 
 *********************************************************************************/

volatile uint16_t p33c_UartPort_SetBaudrate(
            volatile uint16_t port_no, 
            volatile uint32_t baud
    )
{
    volatile uint16_t retval=1;
    volatile struct P33C_UART_INSTANCE_s* uart;
    volatile uint32_t _brg=0;

    // Check port number specified by user
    if (port_no > P33C_UART_COUNT)
        return(0);
    
    // Capture UART instance SFR block
    uart = p33c_MpUartPort_GetHandle(port_no);
    if (uart != NULL) {
    
        // Update oscillator setting
        retval &= p33c_Osc_GetFrequencies();

        // Check which baud rate option is set
        _brg = (uint32_t)(SystemFrequencies.fp / baud);

        // IF legacy mode of baud clock generation is selected, divide baud clock setting by x,  
        // where x = 4 or 16 depending on the BRGH bit
        if (!uart->UxMODEH.bits.BCLKMOD) { 

            if (uart->UxMODE.bits.BRGH) { // If High Speed Baud Rate Clock Divider 4 is selected 
                _brg = ((_brg >> 2)-1); // divide by 4, subtract 1
            }
            else { // If Low Speed Baud Rate Clock Divider 16 is selected 
                _brg = ((_brg >> 4)-1); // divide by 16, subtract 1
            }
        }

        // Set UART port Baud Rate divisor bits
        uart->UxBRG.value = (uint16_t)(_brg & 0x0000FFFF);
        uart->UxBRGH.value = (uint16_t)((_brg & 0x00FF0000) >> 16);
    
    }
    else { retval = 0; } // return error

    
    return(retval);       
    
}

/*********************************************************************************
 * @fn volatile uint16_t p33c_UartPort_GetBaudrate(volatile uint16_t port_no)
 * @ingroup lib-layer-pral-functions-public-uart
 * @brief  Gets the most recent Baud Rate of the specified UART interface
 * @param  port_no Index of UART peripheral instance of type unsigned integer
 * @return Baud Rate in signal segments per second of type unsigned integer of the UART interface Baud Rate generator
 * 
 * @details
 *     This function returns the value of the Baud Rate register of the 
 *     specified UART peripheral instance in [Baud Per Second]
 * 
 *********************************************************************************/

volatile uint32_t p33c_UartPort_GetBaudrate(volatile uint16_t port_no)
{
    volatile uint32_t retval=1;
    volatile uint32_t _brg=0;
    volatile uint32_t _baud=0;
	volatile struct P33C_UART_INSTANCE_s* uart;
    
    // Check port number specified by user
    if (port_no > P33C_UART_COUNT)
        return(0);
    
    // Capture UART instance SFR block
    uart = p33c_MpUartPort_GetHandle(port_no);

    // Update oscillator setting
    retval &= p33c_Osc_GetFrequencies();

    // Read Baud Rate Register
    _brg = (uart->UxBRGH.value);
    _brg <<= 16;
    _brg |= uart->UxBRG.value;
    
    // IF legacy mode of baud clock generation is selected, divide baud clock setting by x,  
    // where x = 4 or 16 depending on the BRGH bit
    if (!uart->UxMODEH.bits.BCLKMOD) { 

        if (uart->UxMODE.bits.BRGH) { // If High Speed Baud Rate Clock Divider 4 is selected 
            _brg = ((_brg+1) << 2); // add 1, multiply by 4
        }
        else { // If Low Speed Baud Rate Clock Divider 16 is selected 
            _brg = ((_brg+1) << 4); // add 1, multiply by 16
        }
    }

