microchip-pic-avr-examples/dpsk3-power-boost-voltage-mode-control/dpsk_boost_vmc.X/sources/common/p33c_pral/p33c_uart.c
    // Check which baud rate option is set
    if (_brg > 0) { // Uses fractional Baud Rate Generation
        _baud = (uint32_t)(SystemFrequencies.fp / _brg);
        retval = _baud;
    }
    else {
        retval = 0;
    }
    
    return(retval);       
    
}

/*********************************************************************************
 * volatile volatile uint16_t p33c_UartPort_WriteByte(volatile uint16_t port_no, volatile char byte)
 * @ingroup lib-layer-pral-functions-public-uart
 * @brief   Sends a single via an opened UART interface
 * @param   port_no Index of UART peripheral instance of type unsigned integer
 * @param   byte    Single data byte to be sent via specified UART interface object
 * @return 0 = failure, setting UART Baud Rate was not successful
 * @return 1 = success, setting UART Baud Rate was successful
 *  
 * @details
 *     This function sends a single byte via the specified UART peripheral 
 *     instance. 
 * 
 *********************************************************************************/
volatile uint16_t p33c_UartPort_WriteByte(volatile uint16_t port_no, volatile char byte)
{
    volatile uint16_t retval=1;
    volatile struct P33C_UART_INSTANCE_s* uart;

    // Null-pointer protection
    uart = p33c_MpUartPort_GetHandle(port_no);
    if (uart != NULL) {
        uart->UxSTAH.bits.TXWRE = 0;     // Clear transmit error
        uart->UxTXREG.bits.TXREG = byte; // write byte to buffer
    }
    else { retval = 0; }

    return(retval);
}

/*********************************************************************************
 * volatile volatile uint16_t p33c_UartPort_ReadByte(volatile uint16_t port_no, volatile char byte)
 * @ingroup lib-layer-pral-functions-public-uart
 * @brief   Reads a single byte from an opened UART interface 
 * @param   port_no Pointer to UART peripheral instance of type unsigned integer
 * @return  Single data byte read from the specified UART interface
 *  
 * @details
 *     This function reads a single byte from the specified UART interface. 
 * 
 *********************************************************************************/
volatile char p33c_UartPort_ReadByte(volatile uint16_t port_no)
{
    volatile uint16_t retval=1;
    volatile struct P33C_UART_INSTANCE_s* uart;
    
    // Null-pointer protection
    uart = p33c_MpUartPort_GetHandle(port_no);
    if (uart != NULL) {
        retval = (char)(uart->UxRXREG.bits.RXREG);
    }
    else { retval = 0; }

    return(retval);
}

/*********************************************************************************
 * @fn      uint16_t p33c_UartPort_SendBufferDma(volatile struct UART_INTERFACE_s* port)
 * @ingroup lib-layer-pral-functions-public-uart
 * @brief   Sends complete user buffer via an opened UART interface using MDA
 * @param   port        Pointer to UART interface object of type struct UART_INTERFACE_s
 * @param   start_addr  Data buffer start address of type unsigned integer
 * @param   length      Length of data buffer to be sent
 * @return  DMA buffer write to the specified UART interface
 *  
 * @details
 *     This function reads a single byte from the specified UART interface. 
 *
 **********************************************************************************/

volatile uint16_t p33c_UartPort_SendBufferDma(
        volatile struct UART_INTERFACE_s* port, 
        volatile uint16_t start_addr, 
        volatile uint16_t length
    ) 
{

    volatile uint16_t retval=1;
    volatile uint16_t timeout=0;
    volatile struct P33C_UART_INSTANCE_s* uart; 
    volatile struct P33C_DMA_INSTANCE_s* dma; 
    
    // Exit if DMA usage is disabled by user
    if (!port->status.tx_use_dma)
        return(0);
    
    
    // Capture UART and DMA object addresses
    uart = p33c_MpUartPort_GetHandle(port->uart);
    dma  = p33c_DmaInstance_GetHandle(port->TxD.dma);
    
    if ((uart != NULL) && (dma != NULL)) {

        // Set BUSY bit
        port->status.busy = true;
        
        // Wait while previous process is ongoing
        while((dma->DMACNTx.value > 0) && (timeout++<50000));   // Wait until DMA has transferred all data to destination
        if (timeout >= 50000) return(0);                        // Timeout Error
        timeout = 0;                                            // Clear timeout counter
        while((!uart->UxSTA.bits.TRMT) && (timeout++<50000));   // Wait until last TX buffer shifter activity has seized
        if (timeout >= 50000) return(0);                        // Timeout Error
        timeout = 0;                                            // Clear timeout counter
        while((!uart->UxSTAH.bits.UTXBE) && (timeout++<50000)); // Wait until UART signals empty buffer
        if (timeout >= 50000) return(0);                        // Timeout Error
        timeout = 0;                                            // Clear timeout counter
        
        // Reset TX FIFO
        uart->UxMODE.bits.UTXEN = 0;    // Disable Transmitter
        uart->UxSTAH.bits.UTXBE = 1;    // Reset TX FIFO
        uart->UxMODE.bits.UTXEN = 1;    // Enable Transmitter

        // Clear pending TX error flags
        uart->UxSTA.bits.TXCIF = 0; // Clear Transmit Collision Interrupt Flag bit
        uart->UxSTAH.bits.TXWRE = 0; // Clear TX Write Transmit Error Status bit

        dma->DMASRCx.value = start_addr; // Set DMA start address
        dma->DMACNTx.value = length; // Set DMA data set length
        dma->DMACHx.bits.CHREQ = 1; // Trigger DMA request by software
        dma->DMACHx.bits.CHEN = true; // DMA Channel Enable: enabled

        port->status.busy = false;   // clear BUSY bit
        
    }
    else { retval = 0; }
    
    return(retval);
}

/*********************************************************************************
 * @fn      uint16_t p33c_UartPort_SendBufferDma(volatile struct UART_INTERFACE_s* port)
 * @ingroup lib-layer-pral-functions-public-uart
 * @brief   Sends complete user buffer via an opened UART interface using MDA
 * @param   port        Pointer to UART interface object of type struct UART_INTERFACE_s
 * @param   start_addr  Data buffer start address of type unsigned integer
 * @param   length      Length of data buffer to be sent
 * @return  DMA buffer write to the specified UART interface
 *  
 * @details
 *     This function reads a single byte from the specified UART interface. 
 *
 **********************************************************************************/

volatile uint16_t p33c_UartPort_RecieveBufferDma(
        volatile struct UART_INTERFACE_s* port, 
        volatile uint16_t start_addr, 
        volatile uint16_t length
    ) 
{

    volatile uint16_t retval=1;
    volatile struct P33C_UART_INSTANCE_s* uart; 
    volatile struct P33C_DMA_INSTANCE_s* dma; 
    
    // Exit if DMA usage is disabled by user
    if (!port->status.rx_use_dma)
        return(0);
    
    // Capture UART and DMA object addresses
    uart = p33c_MpUartPort_GetHandle(port->uart);
    dma  = p33c_DmaInstance_GetHandle(port->RxD.dma);
    
