microchip-pic-avr-examples/dpsk3-power-boost-voltage-mode-control/dpsk_boost_vmc.X/sources/common/p33c_pral/p33c_uart.c
    if ((uart != NULL) && (dma != NULL)) {

        // Set BUSY bit
        port->status.busy = true;

        // Clear pending RX error flags
        uart->UxSTA.bits.OERR = 0; // Clear Receive Buffer Overflow Interrupt Flag bit
        
        dma->DMADSTx.value = start_addr; // Set DMA start address
        dma->DMACNTx.value = length; // Set DMA data set length
        dma->DMACHx.bits.CHREQ = 0; // Trigger DMA 
        dma->DMACHx.bits.CHEN = true; // DMA Channel Enable: enabled

        port->status.busy = false;   // clear BUSY bit
        
    }
    else { retval = 0; }
    
    
    return(retval);
}

/***********************************************************************************
 * PRIVATE DMA CONFIGURATION TEMPLATES
 **********************************************************************************/

volatile struct P33C_DMA_INSTANCE_s dmaInstanceConfigRxD = {

        .DMACHx.bits.NULLW  = 0,    // No dummy write is initiated
        .DMACHx.bits.TRMODE = 0b00, // Transfer Mode Selection: One-Shot
        .DMACHx.bits.SIZE   = 1,    // Data Size Selection: Byte (8-bit)
        .DMACHx.bits.SAMODE = 0b00, // Source Address Mode Selection: DMASRCn remains unchanged after a transfer completion
        .DMACHx.bits.DAMODE = 0b01, // Destination Address Mode Selection: DMADSTn is incremented based on the SIZE bit after a transfer completion
        .DMACHx.bits.RELOAD = 0,    // Registers are not reloaded to their previous values upon the start of the next operation
        .DMACHx.bits.CHREQ  = 0,    // No DMA request is pending
    
//        .DMACHx.value  = 0x0000,    // Clear DMA Channel n Control Register
        .DMAINTx.value = 0x0000,    // Clear DMA Channel n Interrupt Control Register
        .DMASRCx.value = 0x0000,    // Clear DMA Channel n Source Address Register
        .DMADSTx.value = 0x0000,    // DMA Channel n Destination Address Register
        .DMACNTx.value = 0x0000     // DMA Channel n Count Register
    };

volatile struct P33C_DMA_INSTANCE_s dmaInstanceConfigTxD = {

        .DMACHx.bits.NULLW  = 0,    // No dummy write is initiated
        .DMACHx.bits.TRMODE = 0b00, // Transfer Mode Selection: One-Shot
        .DMACHx.bits.SIZE   = 1,    // Data Size Selection: Byte (8-bit)
        .DMACHx.bits.SAMODE = 0b01, // Source Address Mode Selection: DMASRCn is incremented based on the SIZE bit after a transfer completion
        .DMACHx.bits.DAMODE = 0b00, // Destination Address Mode Selection: DMADSTn remains unchanged after a transfer completion
        .DMACHx.bits.RELOAD = 0,    // Registers are not reloaded to their previous values upon the start of the next operation
        .DMACHx.bits.CHREQ  = 0,    // No DMA request is pending
    
        .DMAINTx.value = 0x0000,    // Clear DMA Channel n Interrupt Control Register
        .DMASRCx.value = 0x0000,    // Clear DMA Channel n Source Address Register
        .DMADSTx.value = 0x0000,    // DMA Channel n Destination Address Register
        .DMACNTx.value = 0x0000     // DMA Channel n Count Register
    };


// end of file
